using System;

namespace FirstTask_RusanovaA
{
    class First
    {
        public static void Print() 
        {

            Console.WriteLine("Привіт! Я твій особистий помічник по плануванню ідеального відпочинку!\nПідкажи, будь ласка як я можу до тебе звертатись?");
            string name = Console.ReadLine();

            Console.WriteLine($"Приємно познайомитись з тобою, {name}! \n Підкажи, будь ласка, дату твого народження у форматі mm/dd/yyyy ");
            DateTime bday = Convert.ToDateTime(Console.ReadLine());


            // визначити вік
            DateTime today = DateTime.Today;
            int age = today.Year - bday.Year;
            if (bday > today.AddYears(-age))
                age--;


            // визначити сезон народження. 

            string yearperiod;


            if (bday.Month == 6 || bday.Month == 7 || bday.Month == 8)
            {
                yearperiod = "літом";
                Console.ForegroundColor = ConsoleColor.DarkYellow;
                Console.WriteLine($"Чудово! Ти відмичаєш свій день народження в найтеплішу пору року - {yearperiod}. \nА також тобі {age} - це ідеальний вік для подорожей та пригод!");
            }
            else if (bday.Month == 3 || bday.Month == 4 || bday.Month == 5)
            {
                yearperiod = "весною";
                Console.ForegroundColor = ConsoleColor.Green;
                Console.WriteLine($"Супер! Ти відмичаєш свій день народження в найквітучу пору року - {yearperiod}. \nА також тобі {age} - це ідеальний вік для подорожей та пригод!");
            }
            else if (bday.Month == 12 || bday.Month == 1 || bday.Month == 2)
            {
                Console.ForegroundColor = ConsoleColor.DarkBlue;
                Console.WriteLine($"Здорово! Ти відмичаєш свій день народження в найказковішу пору року - зимою. \nА також тобі {age} - це ідеальний вік для подорожей та пригод!");
            }
            else if (bday.Month == 9 || bday.Month == 10 || bday.Month == 11)
            {
                Console.ForegroundColor = ConsoleColor.Red;
                Console.WriteLine($"Клас! Ти відмичаєш свій день народження в золоту пору року - восени. \nА також тобі {age} - це ідеальний вік для подорожей та пригод!");
            }
            else
            {
                Console.WriteLine("Ти народилась і то добре, а тепер введи дату народження як просили");
            }

            Console.ForegroundColor = ConsoleColor.Black;
            Console.WriteLine("Я пропоную тобі пройти тест і взначити твій ідеальний вид відпочинку. Ти згоден?");

            string answer = Console.ReadLine();

            switch (answer)
            {
                case "так":
                    Console.WriteLine($"Дякую за довіру, {name}, давай розпочнемо тест!");
                    break;
                case "да":
                    Console.WriteLine($"Дякую за довіру, {name}, давай розпочнемо тест!");
                    break;
                case "ні":
                    Console.WriteLine($"Не хвилюйся, це не займе багато часу! {name}, давай ми почнем тес, а в будь який момент ти зможеш зупунитись. Погнали!");
                    break;
                case "нет":
                    Console.WriteLine($"Не хвилюйся, це не займе багато часу! {name}, давай ми почнем тес, а в будь який момент ти зможеш зупунитись. Погнали!");
                    break;
                default:
                    Console.WriteLine($"{name}, ти вніс незрозуміло відповідь, то ж я сприймаю її як згоду. Погнали!");
                    break;
            }

            Console.ReadLine();


            Console.WriteLine($"І перше питання: {name}, підкажи як часто ти подорожуєш?Тобі треба ввести номер відповіді, як подобається тобі найбільше.\n" +
                $"1. Можу влаштувати для себе відпочинок в любий день, головне, щоб було куди і з ким піти \n2. Я використовую кожну можливість для подорожей. Можу поіхати кудить навіть просто на вихідні\n3. Я подорожую приблизно кожні пів року\n4. Обовязково їду влітку на море.. ну а там як вийде");

            int ans1 = int.Parse(Console.ReadLine());


            Console.WriteLine("Супер! А тепер давай дізнаємось, що ти візьмеш з собою в подорож?");
            Console.WriteLine("1. Головне це зручне взуття, а з іншим розберусь на місці\n2. Пару футболок, повербанк та щось тепленьке\n3. Місткий рюкзак, щоб в нього помістились сувенири\n4. Аптечку, бо вона завжди знадобиться, купальник, теплу кофту.. треба бути готовим до будь якоі погоди");


            int ans2 = int.Parse(Console.ReadLine());

            Console.WriteLine("З речами розібрались! А як ти зазвичай готуєшся до відпустки?");

            Console.WriteLine("1. За пару годинок до літака складаю рюкзак і привіт пригоди))\n2. Готель забронйований, основний маршрут складений, а далі побачемо\n3. Читаю відгуки де краще жити, що варто побачити. Люблю все тримати під контролем\n4. Спитаю поради друзів, бо надаю перевагу перевіреним місцям. Складаю перелік, що необхідно побачити та скоштувати, бо не хочу нічого пропустити");


            int ans3 = int.Parse(Console.ReadLine());

            Console.WriteLine($"Здорово, йдемо далі! {name}, а кого ти візьмеш з собою у подорож?");
            Console.WriteLine($"1. На жаль мій темп рідко хто витримує, то ж поіду один\n2. Друзів або кохану людину, разом веселіше\n3. Батьків, вони давно хотіли відпочинку\n4. Родину, дітей - хіба без них можливо насолодитись відпусткою?");

            int ans4 = int.Parse(Console.ReadLine());


            Console.WriteLine($"Чудова компанія! А який вид транспорту ти обираєш для подорожей?");
            Console.WriteLine($"1. Любий, я і автостопом, і літаком можу!\n2.Люблю ходити пішки, це і корисно і побачу саме життя місцевих\n3. Автобус,таксі\n4. Не люблю витрачати багато часу на дорогу, тому краще за все це літак");

            int ans5 = int.Parse(Console.ReadLine());


            int result = ans1 + ans2 + ans3 + ans4 + ans5;

            Console.WriteLine($"{name}, дякую тобі за витрачений час!");



            if (result >= 4 && result <= 9)
            {
                Console.WriteLine($"По результатах тесту мені очевидно, що ти - людина свято! Ти можеш влаштувати собі пригоди на ровному місці, це неймовірно круто! Тому я пропоную тобі подійний туризм.\nЯ зможу запропонувати тобі перелік подій, свят, фестівалей в різних куточках світу, які подарять тобі безліч яскравих вражень! То ж не зволікай, поспішай =)");

            }

            else if (result >= 10 && result <= 15)
            {
                Console.WriteLine($"Ти звик подорожувати без нічого, а у відпустці для тебе головне — емоції та враження. Так що збирай мінімум речей, а я вже підготував для тебе перелік різних екскурсійних і навіть одноденних турів. Навколо ще стільки цікавого, що ти обов'язково маєш це побачити");
            }

            else
            {
                Console.WriteLine($"Немає нічого кращого, ніж прокидатися щоранку, снідати свіжими овочами та йти до моря. Вода, сонце, чисте свіже повітря це твоя стихія.\nА я вже маю багато цікавих пропозицій для тебе і твоєі родини, так що не зволікай, я завжди буду рада допомогти");

            }


            Console.ReadLine();

        }
    }
}
